papers/prl-11-fisherdiscriminant.html
---
layout: page
title: Penalized Fisher Discriminant Analysis and Its Application to Image-based Morphometry
---
<hr />

<p>
<b>Wei Wang, Yilin Mo, John A. Ozolek, Gustavo K. Rohde</b>
</p>

<p>
<i>Pattern Recognition Letters</i>, Nov 2011, Volume 32, Issue 15, Pages 2128-2135
</p>

<div id="outline-container-org0be2861" class="outline-2">
<h2 id="org0be2861">Abstract</h2>
<div class="outline-text-2" id="text-org0be2861">
<p>
Image-based morphometry is an important area of pattern recognition research, with numerous applications in science and technology (including biology and medicine). Fisher linear discriminant analysis (FLDA) techniques are often employed to elucidate and visualize important information that discriminates between two or more populations. We demonstrate that the direct application of FLDA can lead to undesirable errors in characterizing such information and that the reason for such errors is not necessarily the ill conditioning in the resulting generalized eigenvalue problem, as usually assumed. We show that the regularized eigenvalue decomposition often used is related to solving a modified FLDA criterion that includes a least-squares-type representation penalty, and derive the relationship explicitly. We demonstrate the concepts by applying this modified technique to several problems in image-based morphometry, and build discriminant representative models for different data sets.
</p>
</div>
</div>
